Revit 2027 API
ToggleButtonData(String, String) Constructor
Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ToggleButtonData(
	string name,
	string text
)
Public Sub New (
	name As String,
	text As String
)
public:
ToggleButtonData(
	String^ name,
	String^ text
)
new :
        name : string *
        text : string -> ToggleButtonData
Parameters
name String
The internal name of the new button.
text String
The user visible text seen on the new button.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is passed for one or more arguments.
ArgumentException | Thrown when an empty string is passed for one or more arguments.
See Also
Reference
ToggleButtonData Class
ToggleButtonData Overload
Autodesk.Revit.UI Namespace